app/Controllers/Home.php

SELECT *
FROM `tbl_trainers`
SELECT *
FROM `tbl_blogs`
SELECT *
FROM `tbl_setting`
WHERE `id` = 11
 LIMIT 1
SELECT *
FROM `tbl_schedule`
---
    public function index() {
        $trainers = new TrainerModel();
        $details['trainers'] = $trainers->findAll();
        $blog = new BlogsModel();
        $details['blogs'] = $blog->findAll();
        $settings = new SettingModel();
        $data['detail'] = $settings->where('id', 11)->first();
        $date1 = strtotime(date('j M Y'));
        $date2 = strtotime(session()->get('expire_date') ?? '');
        $schedule = new ScheduleModel();
        $schedules_data = $schedule->findAll();

SELECT *
FROM `tbl_setting`
WHERE `id` = 11
 LIMIT 1
---
          }
        }
        $settings = new SettingModel();
        $data['detail'] = $settings->where('id', 11)->first();